hello_world :-
    write('Hello, World!'), nl.

pow(A,B,X):-                        % степень 
    pw(A,B,X,A,1).
pw(_,0,1,_,_):-!.
pw(_,B,R,R,B):-!.
pw(A,B,X,R,I):-
    I<B, 
    RN is R*A, 
    IN is I+1, 
    pw(A,B,X,RN,IN).
%----------------------------------------------------------------------------------------------------------------------------------------------
otDo(Ot,Do,X):-                     % от до включительно (перебор) otDo(1,5,X). -> X=5,4,3,2,1
    DoN is Do+1, 
    otD(Ot,DoN,X).
otD(Ot,Do,X):-
    OtN is Ot+1, 
    OtN<Do, 
    otD(OtN,Do,X).
otD(X,_,X).
%----------------------------------------------------------------------------------------------------------------------------------------------
all_pow_list(X,N,M):-               % перебор всех a^b (возможны повторения)
    otDo(2,N,A),
    otDo(2,M,B),
    pow(A,B,X). 

%----------------------------------------------------------------------------------------------------------------------------------------------
cntr(A):-                           % считает 
    not(mem(A)), 
    asserta(mem(A)), 
    count(C),
    !, 
    NewI is C+1, 
    asserta(count(NewI)).
%----------------------------------------------------------------------------------------------------------------------------------------------
run(_,N,M):-
    asserta(count(0)),              % Добавляет факт в базу знаний 
    asserta(mem(0)),
    asserta(i(0)), 
    all_pow_list(A,N,M), 
    cntr(A), 
    fail.
run(X,_,_):-
    !,
    count(X),
    !, 
    retractall(mem(_)),             % Удаляет из базы знаний факты термах 
    retractall(count(_)).